In [3]:
import pandas as pd

Data Analysis
1. Description
2. Diagonosis
3. Prediction
4. Actions/Prescription

In [4]:
df=pd.read_csv('u.data')

In [8]:
df.head()

      0\t50\t5\t881250949
0    0\t172\t5\t881250949
1    0\t133\t1\t881250949
2  196\t242\t3\t881250949
3  186\t302\t3\t891717742
4   22\t377\t1\t878887116

In [9]:
df=pd.read_csv('u.data',sep='\t')

In [10]:
df.head()

     0   50  5  881250949
0    0  172  5  881250949
1    0  133  1  881250949
2  196  242  3  881250949
3  186  302  3  891717742
4   22  377  1  878887116

In [11]:
# naming coloumn
cols=['user_id','movie_id','rating','ts']

In [12]:
#read the file
df=pd.read_csv('u.data',sep='\t',names=cols)

In [13]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

## Exploratory Data Analysis(EDA)

In [14]:
df.sample(5)

       user_id  movie_id  rating         ts
56893      407       603       4  875044037
65351      519      1612       5  883250148
79962      907       245       4  880158556
50675      609       294       2  886895346
40767      592       521       5  882955703

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [16]:
df.describe()#it shows columns which have integer values by default

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [17]:
df.describe(include='all')#include all columns

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

### Try to find the Different Data
1. Strings with Categorical Info
2. Strings with random stuff
3. Numbers with Quantified information
4. Numbers with catagorical info
5. Random Numbers or ID sort of data

In [18]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [21]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [22]:
df['rating'].nunique()

5

In [23]:
df['user_id'].nunique()

944

In [25]:
df['movie_id'].nunique()

1682

In [28]:
# reading new file
df1=pd.read_csv('u.item',sep='|',encoding='ISO-8859-1')

In [29]:
df1.head()

,1,Toy Story (1995),01-Jan-1995,Unnamed: 3,http://us.imdb.com/M/title-exact?Toy%20Story%20(1995),0,0.1,0.2,1.1,1.2,...,0.6,0.7,0.8,0.9,0.10,0.11,0.12,0.13,0.14,0.15
0,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
1,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,6,Shanghai Triad (Yao a yao yao dao waipo qiao) ...,01-Jan-1995,NaN,http://us.imdb.com/Title?Yao+a+yao+yao+dao+wai...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [30]:
df1.sample(5)

,1,Toy Story (1995),01-Jan-1995,Unnamed: 3,http://us.imdb.com/M/title-exact?Toy%20Story%20(1995),0,0.1,0.2,1.1,1.2,...,0.6,0.7,0.8,0.9,0.10,0.11,0.12,0.13,0.14,0.15
1591,1593,Death in Brunswick (1991),16-Aug-1996,NaN,http://us.imdb.com/M/title-exact?Death%20in%20...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
110,112,Flipper (1996),10-May-1996,NaN,http://us.imdb.com/M/title-exact?Flipper%20(1996),0,0,1,0,1,...,0,0,0,0,0,0,0,0,0,0
176,178,12 Angry Men (1957),01-Jan-1957,NaN,http://us.imdb.com/M/title-exact?12%20Angry%20...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
891,893,For Richer or Poorer (1997),01-Jan-1997,NaN,http://us.imdb.com/M/title-exact?imdb-title-11...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1570,1572,Wend Kuuni (God's Gift) (1982),01-Jan-1982,NaN,http://us.imdb.com/M/title-exact?Wend%20Kuuni%...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [31]:
df1.columns

Index(['1', 'Toy Story (1995)', '01-Jan-1995', 'Unnamed: 3',
       'http://us.imdb.com/M/title-exact?Toy%20Story%20(1995)', '0', '0.1',
       '0.2', '1.1', '1.2', '1.3', '0.3', '0.4', '0.5', '0.6', '0.7', '0.8',
       '0.9', '0.10', '0.11', '0.12', '0.13', '0.14', '0.15'],
      dtype='object')

In [32]:
df1.shape

(1681, 24)

In [36]:
item_cols=['movie_id','title']+[str(i) for i in range(22)]

In [37]:
item_cols=['movie_id','title']+list(range(22))

### Comprehensions

In [33]:
a=[4,8,2,7,9]

In [34]:
b=[i*2 for i in a]

In [35]:
b

[8, 16, 4, 14, 18]

In [38]:
df1=pd.read_csv('u.item',sep='|',names=item_cols,encoding='ISO-8859-1')

In [39]:
df1.sample(5)

,movie_id,title,0,1,2,3,4,5,6,7,...,12,13,14,15,16,17,18,19,20,21
942,943,Killing Zoe (1994),01-Jan-1994,NaN,http://us.imdb.com/M/title-exact?Killing%20Zoe...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
647,648,"Quiet Man, The (1952)",01-Jan-1952,NaN,"http://us.imdb.com/M/title-exact?Quiet%20Man,%...",0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
1354,1355,Infinity (1996),04-Oct-1996,NaN,http://us.imdb.com/M/title-exact?Infinity%20(1...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
308,309,Deceiver (1997),01-Jan-1997,NaN,http://us.imdb.com/M/title-exact?Liar+(1997),0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
498,499,Cat on a Hot Tin Roof (1958),01-Jan-1958,NaN,http://us.imdb.com/M/title-exact?Cat%20on%20a%...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [43]:
df1=pd.read_csv('u.item',sep='|',names=item_cols,encoding='ISO-8859-1')[['movie_id','title']]

In [44]:
df1.sample(3)

      movie_id                   title
818        819            Eddie (1996)
1477      1478  Dead Presidents (1995)
1356      1357   For the Moment (1994)

In [45]:
#merging data frames

In [46]:
movie=pd.merge(df,df1,on='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [47]:
#Remove the reduntant or useless columns i.e ts
movie.drop('ts',axis=1,inplace=True)

In [48]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [49]:
movie.columns

Index(['user_id', 'movie_id', 'rating', 'title'], dtype='object')

In [50]:
#Find the number of ratings for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [53]:
#Find the average rating for each movie
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64